cases/artigo_mestrado/old/ao-mestrado/fluid/Allrun
#!/bin/bash
# Legacy wrapper — use ./Allmesh for mesh only.
exec "$(dirname "$0")/Allmesh" "$@"
