cases/artigo_mestrado/old/ao-mestrado/fluid/system/createPatchDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

pointSync false;

patches
(
    {
        name        inlet;
        patchInfo   { type patch; }
        constructFrom set;
        set         fluid_end_back;
    }
    {
        name        outlet;
        patchInfo   { type patch; }
        constructFrom set;
        set         fluid_end_front;
    }
    {
        name        wall;
        patchInfo   { type wall; }
        constructFrom set;
        set         fluid_lateral;
    }
);
